{
    "intents": [
        {
            "tag": "greetings",
            "patterns": [
              "Hi",
              "Hi there",
              "Hey",
              "Hi bot",
              "Hi assistant",
              "Hello there",
              "Hello Bot",
              "Greetings",
              "What's up",
              "How's it going",
              "Howdy",
              "Hey there",
              "How do you do?",
              "How are you doing today?",
              "It's nice to see you again",
              "What brings you here today?",
              "How can I help you today?",
              "Is there anything I can do for you?",
              "How may I assist you?",
              "What can I do for you today?",
              "What's on your mind?",
              "Good morning",
              "Good afternoon",
              "Good evening"
            ],
            "responses": [
              "Hello there, how can I assist you?",
              "Hello there, how can I help you?",
              "Hey there, what can I do for you?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
              "Goodbye",
              "See you later",
              "Catch you later",
              "Farewell",
              "Take care",
              "Have a nice day",
              "Bye bye",
              "See you soon",
              "Until next time",
              "It was nice talking to you",
              "I'll be in touch",
              "I'll see you around",
              "Take it easy",
              "Later",
              "Laterz",
              "Peace out",
              "See ya later, alligator",
              "Adios",
              "Later, tater"
            ],
            "responses": [
              "Goodbye! Have a great day.",
              "Bye! Take care.",
              "See you later!",
              "Farewell!",
              "Take care and see you soon.",
              "Wishing you a wonderful day!",
              "See you soon.",
              "It was nice talking to you.",
              "I'll be in touch.",
              "I'll see you around."
            ]
        },
        {
            "tag": "age",
            "patterns": [
              "What's your age?",
              "How old are you?",
              "Tell me your age",
              "Age?",
              "When were you born?",
              "How many years have you lived?",
              "How long have you been around?",
              "What is your age in human years?",
              "What is your birthdate?",
              "How old will you be on your next birthday?",
              "How old are you in dog years?",
              "How old are you in cat years?",
              "How old are you in tortoise years?",
              "How old are you in computer years?",
              "How long have you been running?",
              "When did you first come online?",
              "What is your creation date?",
              "What is your birthday?",
              "What is your birth year?",
              "How old are you in AI years?",
              "How old are you in chatbot years?",
              "How old are you in Bard years?",
              "How old are you in Google years?",
              "How old are you in human years, dog years, cat years, tortoise years, computer years, AI years, chatbot years, Bard years, and Google years?",
              "I want to know your age",
              "I want to know how old you are",
              "What is your age in simple words?"
            ],
            "responses": [
                "I am a large language model. I do not have an age."
            ]


        },
        {
            "tag": "name",
            "patterns": [
              "What's your name?",
              "Do you have a name?",
              "Tell me your name",
              "Name?",
              "Who are you?",
              "What is your name, please?",
              "What do you call yourself?",
              "What is your handle?",
              "What is your moniker?",
              "What is your moniker?",
              "How do you identify yourself?",
              "What is your identity?",
              "What is your moniker?",
              "What is your tag?",
              "What is your label?",
              "What is your handle?",
              "What is your callsign?",
              "What is your moniker?",
              "What is your alias?",
              "What is your appellation?",
              "What is your denomination?",
              "What is your sobriquet?",
              "What is your nickname?",
              "What is your agnomen?",
              "What is your epithet?",
              "What is your cognomen?",
              "What is your handle?",
              "What is your moniker?"
            ],
            "responses": [
              "You can call me EduNav.",
              "My name is EduNav.",
              "I go by the name EduNav."
            ]
        },
        {
            "tag": "rating",
            "patterns": [
              "What is the rating of SSM college?",
              "Can you tell me about the college's rating?",
              "How does SSM college rate among others?",
              "What's the rating of SSM college?",
              "Tell me the current rating of SSM college.",
              "What is the college's rating on Google?",
              "What is the college's rating on Google rating?",
              "How does SSM college compare to [other college name] in terms of rating?",
              "What is the college's rating among [major name] programs?",
              "What is the rating of Srinagar School of Management?",
              "Can you tell me about the college's rating?",
              "How does Srinagar School of Management rate among others?",
              "What's the rating of Srinagar School of Management?",
              "Tell me the current rating of Srinagar School of Management.",
              "What is the college's rating on Google?",
              "What is the college's rating on Google rating?",
              "How does Srinagar School of Management compare to [other college name] in terms of rating?",
              "What is the college's rating among [major name] programs?",
              "What is the rating of SSM college on Google?",
              "What is the rating of SSM college on Google rating?",
              "How does SSM college compare to [other college name] in terms of rating?",
              "What is the rating of SSM college among [major name] programs?",
              "What is the rating of Srinagar School of Management on Google?",
              "What is the rating of Srinagar School of Management on Google rating?",
              "How does Srinagar School of Management compare to [other college name] in terms of rating?",
              "What is the rating of Srinagar School of Management among [major name] programs?",
              "What is the rating of SSM college on [other website name]?",
              "What is the rating of SSM college on [other ranking system name]?",
              "How does SSM college compare to [other college name] in terms of rating on [other website name]?",
              "How does SSM college compare to [other college name] in terms of rating on [other ranking system name]?"
            ],
            "responses": [
              "SSM college has a rating of 2.8 out of 5 on Google."
            ]
        },
        {
            "tag": "admission_criteria",
            "patterns": [
                "What are the admission criteria for SSM college?",
                "What is the admission criteria?",
                "What criteria are considered for admission to SSM college?",
                "Could you provide details about the admission criteria?",
                "What prerequisites are required for admission to SSM college?",
                "What is the minimum GPA needed for admission?",
                "What SAT score is required for admission?",
                "What ACT score is considered for admission?",
                "Which extracurricular activities influence SSM college admission?",
                "How does leadership experience affect admission to SSM college?",
                "When is the application deadline for SSM college?",
                "What is the application fee for SSM college?",
                "Can you explain the interview process for SSM college admission?",
                "Please outline the financial aid process for SSM college.",
                "Tell me about the diversity statement for SSM college admission.",
                "What should be included in the personal statement for SSM college?",
                "How important are letters of recommendation for admission to the college?",
                "Could you explain the waitlist process for SSM college admission?",
                "What is the appeal process for SSM college admission?",
                "How do transfer students get admitted to SSM college?",
                "What is the admission process for international students at the college?",
                "Is there a process for late applications to SSM college?",
                "Explain the rolling admission process for SSM college.",
                "What can you tell me about early decision admission to SSM college?",
                "How does the early action admission process work for SSM college?",
                "What is the guaranteed transfer admission process for SSM college?",
                "Please explain the process for obtaining a guaranteed scholarship at SSM college.",
                "How are merit-based scholarships awarded for SSM college admission?",
                "Could you provide details about the need-based scholarship admission process at SSM college?",
                "What is the process for obtaining an athletic scholarship at the college?",
                "How can I apply for an academic scholarship at SSM college?"
            ],
            "responses": [
                "Admission to SSM college is primarily based on academic merit. Candidates must have completed their 10+2 education with a focus on Physics, Chemistry, and Mathematics. The minimum required marks for the OC category is 50% (45% for SC/ST).",
                "The college also considers extracurricular activities and leadership experience. Applicants must submit their academic transcripts, a personal statement, and letters of recommendation."
            ]
        },
        {
            "tag": "admission_apply",
            "patterns": [
                "How do I apply for admission to SSM college?",
                "What are the steps involved in applying for admission to SSM college?",
                "Can you provide me with a step-by-step guide on how to apply for admission to SSM college?",
                "What are the required documents for applying for admission to SSM college?",
                "What is the application fee for applying to SSM college?",
                "What is the application deadline for SSM college?",
                "When will I be notified of my acceptance status to SSM college?",
                "How can I contact the admissions office at SSM college?",
                "What is the email address of the admissions office at SSM college?",
                "What is the phone number of the admissions office at SSM college?",
                "What is the address of the admissions office at SSM college?",
                "Is there a link to the admission application form for SSM college?",
                "Can you provide me with a link to the admission application form for SSM college?",
                "Is there a video tutorial on how to apply for admission to SSM college?",
                "Can you provide me with a video tutorial on how to apply for admission to SSM college?",
                "Are there any scholarships available for students applying to SSM college?",
                "How can I apply for scholarships for SSM college?",
                "What are the requirements for scholarships for SSM college?",
                "What is the deadline for applying for scholarships for SSM college?",
                "When will I be notified of the results of my scholarship application for SSM college?",
                "How can I contact the financial aid office at SSM college?",
                "What is the email address of the financial aid office at SSM college?",
                "What is the phone number of the financial aid office at SSM college?",
                "What is the address of the financial aid office at SSM college?"
            ],
            "responses": [
                "To apply for admission, follow these steps:\n1. Visit the college campus.\n2. Collect the admission form from the college.\n3. Fill it up carefully.\n4. Attach the required documents.\n5. Submit it to the college office.\n6. The documents should be submitted in original, along with three attested copies."
            ]
        },
        {
            "tag": "documents_admit",
            "patterns": [
                "What are the documents required for admission?",
                "List of documents needed for admission?",
                "Can you tell me about the admission document checklist?",
                "What documents should I submit for admission?",
                "Please provide information on admission document requirements.",
                "Which documents are mandatory for admission?",
                "What paperwork do I need for admission?",
                "Tell me about the admission document submission process.",
                "I need details about the required admission documents.",
                "Are there any specific papers needed for admission?",
                "Could you explain the admission document procedure?",
                "What is the document verification process for admission?",
                "Where can I find the list of admission document requirements?",
                "Do I need to submit any certificates for admission?",
                "Are there any essential documents for enrollment?",
                "What documentation is necessary for admission?",
                "How do I know which documents to provide for admission?",
                "Can you clarify the admission document submission steps?",
                "What should I bring for admission documentation?",
                "Please elaborate on the admission document checklist.",
                "What kind of identification documents are needed for admission?",
                "I'm curious about the admission document essentials.",
                "Could you provide more details about the required admission paperwork?",
                "Tell me about the documents I need to bring for admission.",
                "Are there any specific forms I need to fill out for admission?",
                "What are the admission document prerequisites?",
                "Please guide me on the necessary admission documents.",
                "I want to know about the documents necessary for enrollment.",
                "What is the process for submitting admission documents?",
                "Do I need to notarize any documents for admission?",
                "What are the admission document submission guidelines?",
                "Can you give me a breakdown of the admission document criteria?"
            ],
            "responses": [
                "The documents required for admission are:\n1. Date of Birth Certificate / Marks Sheet\n2. Matriculation Marks Certificate for Diploma Courses / 10+2 Marks Certificate (for UG Engineering Courses and BBA)\n3. Bachelor's Degree along with Marks Certificates for PG Courses\n4. Last Institution's leaving certificate and character certificate from the last School\n5. Affidavit on Non-Judicial Paper (Sample attached)\n6. 8 Passport Size Photographs"
            ]
        },
        {
            "tag": "campus_fac",
            "patterns": [
                "Can you provide information about campus facilities?",
                "Tell me about the facilities on campus.",
                "What facilities does the campus offer?",
                "Give me details about the amenities at the college.",
                "What are the facilities available on campus?",
                "Give me information about the campus facilities.",
                "What kind of facilities does the college campus offer?",
                "Tell me about the services and facilities at the college.",
                "Describe the facilities present on the campus.",
                "Could you provide details about the infrastructure and facilities?",
                "I want to know more about the facilities at the college.",
                "Share some insights into the campus facilities.",
                "Inform me about the available facilities on the campus.",
                "What recreational facilities does the campus have?",
                "Are there any fitness facilities available on campus?",
                "Tell me about the technology and IT facilities on campus.",
                "What kind of laboratories are present at the college?",
                "Are there any study rooms or quiet spaces available?",
                "Tell me about the cultural and arts facilities on campus.",
                "Are there any research facilities available to students?",
                "What medical and health services are provided on campus?",
                "Tell me about the accessibility features of the campus.",
                "Are there any eco-friendly initiatives on campus?",
                "What security measures are in place on the campus?",
                "Tell me about the campus transportation options.",
                "Are there any clubs or student organizations on campus?",
                "What facilities are available for students with disabilities?",
                "Tell me about the accommodation options for students.",
                "Are there any outdoor spaces or gardens on campus?",
                "What facilities are available for recreational activities?",
                "Tell me about the technology resources available to students.",
                "Are there any community spaces or lounges on campus?"
            ],
            "responses": [
                "Of course! I'd be happy to provide information about campus facilities.\n\nCafeteria: The college has a cafeteria and food court inside the campus which serves nutritious and wholesome food. The cafeteria is well-furnished offering a variety of food at an affordable price.\n\nLibrary: Library has good a collection of thousands of books, printed journals, magazines which are enough to satisfy the needs of the students during their course work.\n\nHostel: Hostel facilities are easily available in this college. The college has its own hostel with two buildings. One building is new and one is old. In total, the hostel has more than 80 rooms and the rooms are sharing and is shared by 3 to 4 students.\n\nSports: Ample space is available for indoor sports activities and administrative functioning. There are also Playgrounds for Cricket, Football, and Courts for Badminton, Basketball, Volleyball, etc.\n\nTransport: Bus facilities are provided by the college for both day scholar students and lecturers. The drivers are experienced and the buses are comfortable for an easy and smooth journey.\n\nOther facilities: Medical Facilities, Guest House, Banking Facility."
            ]
        },
        {
            "tag": "placements_clg",
            "patterns": [
                "Can you provide information regarding college placements?",
                "Tell me about the placements at the college.",
                "What is the placement scenario at the college?",
                "Give me details about campus placements.",
                "What companies visit for placements at the college?",
                "Tell me about the companies that offer placements.",
                "Can you give me details about campus recruitment?",
                "Which top recruiters hire students from the college?",
                "Share information about the college's placement opportunities.",
                "How is the placement scenario at the college?",
                "What is the success rate of campus placements?",
                "Provide insights into the college's placement division.",
                "Which renowned companies offer jobs to college students?",
                "Inform me about the placement process at the college.",
                "What types of job roles are offered during placements?",
                "Tell me about the internship opportunities provided by the college.",
                "How does the college prepare students for placements?",
                "Are there any mock interview sessions for placement preparation?",
                "Do students receive assistance with resume building?",
                "Tell me about the alumni network's role in placements.",
                "What is the average salary package offered to students?",
                "How many students usually get placed every year?",
                "Tell me about the placement training programs at the college.",
                "Are there any pre-placement talks organized by companies?",
                "What is the role of the placement cell in the college?",
                "Tell me about any success stories from previous placements.",
                "Are there any international companies that recruit from the college?",
                "Do students have the flexibility to choose their preferred companies?",
                "How does the college maintain relationships with recruiters?",
                "Tell me about any notable achievements of the college's placement division.",
                "What is the duration of the campus placement season?"
            ],
            "responses": [
                "Certainly! I'd be happy to provide information about college placements.\n\nOur placement division assists students with recruitment and creates opportunities through projects, seminars, guest faculty from various industries, internships, and any other Industry-Institute Partnership of which the students can be a part.\n\nTop Recruiters:\n- Microsoft\n- Wipro\n- TATA Consultancy Services\n- Satyam\n- IBM\n- CSC\n- Accenture\n- Patni\n- Oracle\n- Infosys\n- Google\n- Convergys\n- Verizon\n- Nokia\n- Mentor Graphics\n- HSBC\n- Deloitte\n- Cognizant Technology Solutions\n- Polaris\n- NCR\n- Kanbay\n- Dell\n- Honeywell\n- Capmark\n- Motorola"
            ]
        },
        {
            "tag": "major_prg",
            "patterns": [
                "Courses available?",
                "Tell me about majors at SSM college.",
                "Academic programs at SSM college?",
                "List of courses offered?",
                "Majors and programs?",
                "Available study options?",
                "Degrees at SSM college?",
                "What majors are there?",
                "Program details, please?",
                "Available academic streams?",
                "Different academic programs?",
                "Which courses are there?",
                "Majors and study programs?",
                "Fields of study covered?",
                "Specializations offered?",
                "Any unique programs?",
                "Curriculum for majors?",
                "Interdisciplinary programs?",
                "Joint degrees with other institutions?",
                "Research-oriented programs?",
                "Industry-specific programs?",
                "Part-time or evening programs?",
                "Admission requirements?",
                "Faculty for each major?",
                "Co-op or internships?",
                "International exchange programs?",
                "Recent program updates?",
                "Average class size?",
                "Online or distance learning?",
                "Final year projects?",
                "Hands-on experience?",
                "Career prospects?",
                "Could you provide information about the courses offered in SSM college?",
                "I'm interested in knowing what courses SSM college provides.",
                "Can you give me an overview of the academic programs at SSM college?",
                "I'd like to learn about the majors and programs available at the college.",
                "What study options does SSM college have?",
                "Please share details about the available academic streams and majors.",
                "I'm curious about the educational pathways offered by the college.",
                "What kind of degrees can I pursue if I enroll at SSM college?",
                "Tell me about the academic concentrations and tracks the college offers.",
                "Could you describe the various study programs available?",
                "What learning opportunities are presented by the college?",
                "Can you list the degrees that the college grants?",
                "I'm interested in exploring the different study paths at the college.",
                "What subject areas are covered within the college's programs?",
                "Please provide insights into the specialized course options at the college.",
                "Are there any distinctive or unique offerings within the academic programs?",
                "I'm curious about the curriculum highlights for different majors.",
                "Could you elaborate on the interdisciplinary study programs available?",
                "Do they collaborate with other institutions for joint degree programs?",
                "Are there programs tailored for research-oriented studies?",
                "Tell me about the college's industry-specific courses.",
                "Do they have flexible part-time programs for working individuals?",
                "What are the admission requirements for the college's programs?",
                "Share details about the faculty and learning resources specific to each major.",
                "Is there a provision for co-op or internships as part of the courses?",
                "Can you provide insights into international exchange opportunities?",
                "Have there been any recent additions to the programs offered?",
                "What's the average class size like for different majors?",
                "Are there options for online or distance learning?",
                "Tell me about the culminating projects for various majors.",
                "Do students get practical experience within their majors?",
                "What are the career prospects for graduates of different majors from the college?"
            ],
            "responses": [
                "Certainly! SSM college offers a diverse range of undergraduate and postgraduate programs that span various fields of study:\n\nUndergraduate Programs:\n- BACHELOR OF ENGINEERING:\n  - Civil Engineering\n  - Computer Engineering\n  - Electrical Engineering\n  - Electronics & Communications Engineering\n  - Mechanical Engineering\n  - Business Administration\n\nPostgraduate Programs:\n- M.Tech in Electronics & Communications Engineering\n- M.Tech in Mechanical Engineering\n- Master of Business Administration\n- Master of Computer Application\n- Master of Science in Physics"
            ]
        },
        {
            "tag": "hostel_fac",
            "patterns": [
                "Are there any hostel facilities available at the college?",
                "Tell me about the college's hostel accommodations.",
                "Is there a hostel on the college campus?",
                "Can you provide details about the hostel facilities?",
                "What are the options for staying in a college hostel?",
                "Explain the hostel arrangements at the college.",
                "Are students provided with hostel accommodations?",
                "Give me information about the available hostels.",
                "Is there a place to stay on the college premises?",
                "Tell me about the college's dormitory arrangements.",
                "What is the process for applying for hostel accommodation?",
                "Are there separate hostels for male and female students?",
                "Tell me about the amenities provided in the college hostels.",
                "What is the capacity of the college hostels?",
                "Are there any rules or regulations for staying in the hostels?",
                "Can students opt for single rooms in the hostel?",
                "Tell me about the security measures in place in the hostels.",
                "Is there a mess or dining facility in the college hostels?",
                "Are there any recreational facilities in the hostels?",
                "Tell me about the cost of staying in the college hostels.",
                "Is hostel accommodation mandatory for all students?",
                "Are there any curfews or restrictions for hostel residents?",
                "Tell me about the availability of Wi-Fi in the hostels.",
                "What is the process for room allocation in the hostels?",
                "Can students request roommates of their choice in the hostels?",
                "Tell me about any special accommodations for students with disabilities in the hostels.",
                "Are laundry facilities provided in the hostels?",
                "Tell me about the proximity of the hostels to the college campus.",
                "Is there a warden or supervisor for each hostel?"
            ],
            "responses": [
                "Hostel facilities are easily available in this college. The college has its own hostel with two buildings. One building is new and one is old. In total, the hostel has more than 80 rooms and the rooms are sharing and are shared by 3 to 4 students."
            ]
        },
        {
            "tag": "hostel_chrg",
            "patterns": [
                "What are the hostel charges for hostel facilities per year?",
                "Tell me about the hostel fees for accommodation.",
                "How much does it cost to stay in the college hostel?",
                "Give me information about the hostel charges.",
                "What is the annual fee for staying in the college hostel?",
                "Can you provide details about the hostel charges per year?",
                "Tell me about the cost of accommodation in the college hostel.",
                "How much do I need to pay for hostel facilities annually?",
                "Give me information about the yearly hostel fees.",
                "What are the charges for hostel accommodations each year?",
                "Explain the hostel fees for accommodation per annum.",
                "Is there a breakdown of the hostel expenses for a year?",
                "Can you tell me the cost of staying in the college hostel annually?",
                "What is the total amount for hostel facilities for a year?",
                "Are there any additional charges for hostel amenities?",
                "Tell me about any discounts or scholarships available for hostel fees.",
                "What is included in the hostel fee? Are meals included?",
                "Are there different rates for different types of rooms in the hostel?",
                "Tell me about the payment schedule for hostel fees.",
                "Is there a security deposit required for hostel accommodation?",
                "Tell me about the refund policy for hostel fees in case of cancellation.",
                "Are there any late fees for hostel payments?",
                "Tell me about any facilities or services covered by the hostel fee.",
                "What is the mode of payment for hostel charges?",
                "Tell me about any installment options for paying hostel fees.",
                "Is there an option for paying hostel fees online?",
                "Tell me about any penalties for violating hostel rules and regulations.",
                "What is the process for applying for hostel accommodation and paying the fees?",
                "Are there any financial aid options specifically for hostel expenses?",
                "Tell me about the process for adjusting hostel fees if a student leaves mid-year."
            ],
            "responses": [
                "The hostel fee (Mess+room rent) ranges from INR 2700 to INR 3500 in all hostels around the college.\nHostel Fee: INR 33,000 per year."
            ]
        },
        {
            "tag": "sport_fac",
            "patterns": [
                "Are there any Sports facilities available?",
                "Tell me about the sports amenities.",
                "What are the sports facilities like?",
                "Give me information about sports options.",
                "Tell me about the sports facilities available on campus.",
                "Can you provide details about the sports amenities at the college?",
                "What kind of sports options are offered to students?",
                "Give me information about the available sports facilities.",
                "Are there any opportunities for sports and recreational activities?",
                "Explain the sports facilities and activities at the college.",
                "Tell me about the campus provisions for sports and games.",
                "Are there any provisions for indoor and outdoor sports?",
                "Inform me about the sports infrastructure and opportunities.",
                "What recreational and sports options do students have?",
                "Are there any fitness centers or gyms on campus?",
                "Tell me about the extracurricular sports clubs or teams at the college.",
                "What kind of sports events are organized by the college?",
                "Are there any intramural sports leagues for students?",
                "Tell me about the coaching or training available for different sports.",
                "What are the timings for using the sports facilities?",
                "Are there any annual sports tournaments or competitions?",
                "Tell me about any sports scholarships or awards available to students.",
                "What is the role of the sports department in promoting physical activity?",
                "Tell me about the accessibility of sports facilities for students with disabilities.",
                "Are there any sports equipment available for students to borrow?",
                "What measures are in place to ensure the safety of students during sports activities?",
                "Tell me about the intercollegiate sports rivalries and events.",
                "Are there any organized outdoor adventure activities for students?",
                "Tell me about any famous athletes or sports alumni from the college.",
                "What is the process for signing up for sports clubs or teams?"
            ],
            "responses": [
                "Ample space is available for indoor sports activities and administrative functioning. There are also Playgrounds for Cricket, Football, and Courts for Badminton, Basketball, Volleyball, etc.\nIndoor games like chess, carrom, etc are also played.\nParticipants performing outstanding in specific sports are also given opportunities for inter-college tournaments and more."
            ]
        },
        {
            "tag": "approve_AICTE",
            "patterns": [
                "Is SSM College of Engineering and Technology approved by AICTE?",
                "Does AICTE approve SSM College of Engineering and Technology?",
                "Tell me about AICTE approval for the college.",
                "Can you confirm if the college is AICTE approved?",
                "Is the college affiliated with AICTE?",
                "Give me information about AICTE accreditation for the college.",
                "Tell me about the AICTE recognition for SSM College of Engineering and Technology.",
                "Is the college recognized by AICTE?",
                "What is the status of AICTE approval for the college?",
                "Does the college have AICTE affiliation?",
                "Are the engineering programs at the college AICTE approved?",
                "Tell me more about the significance of AICTE approval for the college.",
                "How does AICTE approval impact the quality of education at the college?",
                "Is the college required to meet any specific criteria for AICTE approval?",
                "Tell me about the process of obtaining AICTE approval for an educational institution.",
                "Are there any benefits for students studying in an AICTE approved college?",
                "What are the other regulatory bodies involved in the approval process besides AICTE?",
                "How can I verify the AICTE approval status of SSM College of Engineering and Technology?",
                "Tell me about any recent developments or updates related to AICTE approval for the college.",
                "Is there a specific department or office responsible for managing AICTE affairs at the college?"
            ],
            "responses": [
                "Yes, SSM College of Engineering and Technology is approved by AICTE, New Delhi. It is affiliated with Kashmir University, Hazratbal, Srinagar."
            ]
        },
        {
            "tag": "loc_clg",
            "patterns": [
                "Where is SSM College of Engineering and Technology located?",
                "Tell me the location of SSM College of Engineering and Technology.",
                "Can you provide the address of the college?",
                "What is the geographical location of SSM College of Engineering and Technology?",
                "In which city is SSM College of Engineering and Technology situated?",
                "Where can I find SSM College of Engineering and Technology?",
                "What is the campus address of SSM College of Engineering and Technology?",
                "Give me details about the exact location of the college.",
                "Tell me about the physical address of SSM College of Engineering and Technology.",
                "Where can I visit SSM College of Engineering and Technology?",
                "What is the street address of SSM College of Engineering and Technology?",
                "Inform me about the whereabouts of SSM College of Engineering and Technology.",
                "Could you provide the specific location of SSM College of Engineering and Technology?",
                "What is the postal address of SSM College of Engineering and Technology?",
                "Tell me about the district and state where SSM College of Engineering and Technology is located.",
                "Where exactly can I locate SSM College of Engineering and Technology?",
                "What are the nearby landmarks to SSM College of Engineering and Technology?",
                "Can you provide directions to reach SSM College of Engineering and Technology?",
                "Tell me about the accessibility options to reach SSM College of Engineering and Technology.",
                "Is there any public transportation available to the college?",
                "Can you give me the GPS coordinates of SSM College of Engineering and Technology?"
            ],
            "responses": [
                "SSM College of Engineering and Technology is situated in Parihaspora, Pattan Baramulla, Jammu & Kashmir, India. The Institute is located at Parihaspora (Diver), 20 Kms away from Srinagar City."
            ]
        },
        {
            "tag": "hist_clg",
            "patterns": [
                "What is the history of your college and how has it evolved over time?",
                "Tell me about the evolution of your college over the years.",
                "Give me an overview of the college's history and growth.",
                "When was your college established and how has it developed since then?",
                "Can you provide a brief history of the college?",
                "How has your college transformed since its inception?",
                "Tell me about the journey of your college from its founding to the present day.",
                "Give me insights into the historical background of your college.",
                "What milestones has your college achieved over its history?",
                "Describe the growth and progress of the college since its establishment.",
                "Tell me about any significant developments or changes in your college's history.",
                "What factors have contributed to the growth and success of your college?",
                "Inform me about the significant events that have shaped the history of your college.",
                "Describe the early years of your college and its gradual development over time.",
                "Tell me about the founders and visionaries behind the establishment of your college.",
                "Give me a timeline of key moments in the history of your college.",
                "How has the educational landscape of your college's region been influenced by its history?",
                "Tell me about any notable achievements or recognitions received by your college.",
                "What role has your college played in the community throughout its history?",
                "Give me examples of how your college has adapted to changing educational trends over time."
            ],
            "responses": [
                "Established in 1988, the Srinagar School of Management (SSM) was the first step towards the privatization of technical education in JandK state. Since its inception, the management of this institute has had considerable experience in the field of technical education. Although the institute started as a polytechnic housed in a rented building, thanks to visionary leadership, it grew into an engineering college on its campus only a decade later, with a large land on a green scenic hill with a calm and serene eco-friendly environment. The environment near the famous 12th-century historical Parihaspora city is only 20 km away from the capital Srinagar. Apart from extensive institutional infrastructure, the institute has two large hostels and a huge fleet of buses and light vehicles for the convenience of students and staff.\n\nThe board of the institute consists of respected educators/administrators/technocrats, and highly trained professionals whose leadership is available to the institution. The Principal, HODs, Faculties, and Staff are responsible for establishing and upholding the core objectives, core values, and ethical principles that guide our College. Plans of the college are designed keeping in mind the vision and mission of the institute. For the service of humanity, the institute is committed to creating and disseminating knowledge in the field of technology and management."
            ]
        },
        {
            "tag": "trans_info",
            "patterns": [
                "Can you provide me with information about the transportation facility available at your college?",
                "Tell me about the college's transportation services.",
                "What are the transportation options for students?",
                "How does transportation work for students at your college?",
                "Give me details about the transport facilities at your college.",
                "Are there any buses or vehicles provided by the college for commuting?",
                "Tell me about the availability of transportation for daily commuting.",
                "What modes of transportation are available for students traveling to and from the college?",
                "Inform me about the transportation arrangements for both staff and students.",
                "Are there any shuttle services or bus routes for students?",
                "Explain the transportation network that connects the college to nearby areas.",
                "Tell me about the accessibility of public transportation to the college.",
                "What are the timings of the college's transportation services?",
                "Give me information about the pick-up and drop-off points for college transportation.",
                "Are there any fees associated with using the college's transportation facilities?",
                "Tell me about any special arrangements for differently-abled students regarding transportation.",
                "Are there any restrictions or guidelines for using the college transportation services?",
                "Tell me about the safety measures in place for students using the college transportation.",
                "Can students use the transportation facilities during holidays or weekends?",
                "What steps are taken to ensure punctuality and reliability of the transportation services?"
            ],
            "responses": [
                "The College provides transport facilities with more than 20 buses for the convenience of staff and students. These buses operate from the nearest point of departure and are also used for industrial visits, educational tours, and more."
            ]
        },
        {
            "tag": "trans_time",
            "patterns": [
                "What are the bus timings of the college?",
                "Tell me about the college bus schedule.",
                "When do the buses operate to and from the college?",
                "Can you provide information about the timings of the college buses?",
                "Give me details about the schedule of transportation services at the college.",
                "When can I expect the college buses to arrive and depart?",
                "What are the pickup and drop-off timings for the college buses?",
                "Tell me about the daily operating hours of the college transportation services.",
                "When is the first bus scheduled to reach the college?",
                "At what time do the buses start and end their routes?",
                "Inform me about the bus arrival and departure times for weekdays.",
                "Are there any specific timings for transportation services on weekends?",
                "What is the frequency of college buses during peak hours?",
                "Can you tell me when the last bus leaves the college campus?",
                "Give me an overview of the typical bus timings for students and faculty.",
                "Tell me about any variations in bus timings during holidays or exam periods."
            ],
            "responses": [
                "All the buses reach the college up to 10:00 AM, so that all the students and faculty get ready to attend the classes at 10:30 AM.\nThe buses leave the campus at 4:00 PM, which helps all the students to reach home early and safely."
            ]
        },
        {
            "tag": "grad_time",
            "patterns": [
                "What is the average time it takes students to graduate from your college?",
                "How long does it usually take to complete the programs?",
                "Tell me about the duration of different courses.",
                "Can you provide information about the typical graduation period at your college?",
                "Give me details about the time required to complete various courses.",
                "What is the average duration of study for different programs?",
                "Tell me about the length of time students spend in your college to earn their degrees.",
                "Inform me about the standard study duration for different academic programs.",
                "How much time does it usually take to earn a degree from your college?",
                "Tell me about the expected duration of studies for undergraduate and postgraduate programs.",
                "How many semesters are there in each academic year?",
                "Can you provide a breakdown of the academic calendar for different programs?",
                "Tell me about the credit system and how it affects the time required for graduation.",
                "What factors might influence the duration of study for a student?",
                "Can students complete their programs faster through accelerated options or extra courses?",
                "Tell me about any flexible study arrangements that may affect the time to graduate.",
                "Give me insights into the student workload and course load each semester.",
                "What role does the choice of major play in determining the graduation timeline?",
                "Tell me about any academic requirements that could impact the duration of study.",
                "How does the duration of study at your college compare to other institutions?",
                "Are there any opportunities for students to reduce their time to graduation through internships or co-op programs?",
                "Tell me about the typical student progression path through the academic programs.",
                "Can you provide examples of students who completed their programs earlier than expected?",
                "Give me information about any part-time or evening study options that could impact the duration of study.",
                "Tell me about the maximum time allowed for completing a program and any extensions that can be granted.",
                "What are the implications of transferring credits from other institutions on the graduation timeline?"
            ],
            "responses": [
                "The average time for students to complete an MBA is two years, BE is four years, MTech is two years, MCA is three years, and polytechnic is three years."
            ]
        },
        {
            "tag": "full_form",
            "patterns": [
                "What is the full form of SSM college?",
                "Tell me the complete name of SSM college.",
                "What does SSM college stand for?",
                "Could you provide me with the expanded name of SSM college?",
                "Inform me about the acronym SSM and its complete representation.",
                "What does the abbreviation SSM in SSM college denote?",
                "Give me the full name of the college represented by the initials SSM.",
                "Tell me the meaning behind the acronym SSM college.",
                "Provide the detailed expansion of SSM in SSM college.",
                "Can you explain the full title of SSM college?",
                "Tell me about the origin of the name SSM college and its full form.",
                "What is the significance of the initials SSM in the college's name?",
                "Give me insights into the words represented by the abbreviation SSM in SSM college.",
                "Tell me about the complete name that corresponds to the short form SSM college.",
                "What is the elaboration of the initials SSM college?"
            ],
            "responses": [
                "The full form of SSM college is Srinagar School of Management. Established in 1988, it was the first step towards privatization of technical education in J&K state. The management of this institute has a remarkable track record since inception in the field of technical education."
            ]
        },
        {
            "tag": "principal_clg",
            "patterns": [
                "Who is the principal of the College?",
                "Tell me about the current principal of the college.",
                "Who leads the SSM College of Engineering?",
                "Can you provide information about the principal of SSM College of Engineering?",
                "Give me details about the person currently serving as the principal of the college.",
                "Tell me about the individual responsible for leading SSM College of Engineering.",
                "Who is in charge of the administration and leadership of the college?",
                "Inform me about the head of SSM College of Engineering.",
                "Who holds the position of principal at the college?",
                "Can you share the name of the principal of SSM College of Engineering?",
                "Tell me about the academic leader overseeing SSM College of Engineering.",
                "Who is the head administrator of SSM College of Engineering?",
                "Give me insights into the professional background of the current principal of the college.",
                "Tell me about any notable accomplishments or contributions of the college's principal.",
                "Who is responsible for making administrative and academic decisions at SSM College of Engineering?"
            ],
            "responses": [
                "Dr. Sajad Hussain is the Principal of the SSM College of Engineering."
            ]
        },
        {
            "tag": "scolrship_apply",
            "patterns": [
                "How should I apply for financial aid or scholarship?",
                "What's the process for applying for scholarships or financial assistance?",
                "Can you guide me through the application process for scholarships or financial aid?",
                "I'm interested in financial aid and scholarships. What are the steps to apply?",
                "Could you explain how I should apply for scholarships or financial aid?",
                "What's the procedure for seeking scholarships or financial assistance?",
                "I'd like to know how to apply for scholarships or financial aid. Can you help?",
                "What's the method to submit an application for scholarships or financial aid?",
                "Could you provide information on how to seek scholarships or financial assistance?",
                "How can I start the application process for scholarships or financial aid?",
                "What are the steps involved in applying for scholarships or financial support?",
                "Can you give me details on applying for scholarships or financial aid?",
                "I need guidance on how to proceed with applying for scholarships or financial assistance.",
                "Where should I begin if I want to apply for scholarships or financial aid?",
                "What's the application procedure for scholarships or financial support?",
                "What's the protocol for seeking scholarships or financial assistance?",
                "How do I initiate the process of applying for scholarships or financial aid?",
                "Can you walk me through the steps of applying for scholarships or financial support?",
                "I'm curious about the application process for scholarships or financial aid.",
                "How can I get started with my application for scholarships or financial assistance?",
                "What's the recommended way to apply for scholarships or financial aid?",
                "Could you outline the steps I need to follow to apply for scholarships or financial support?",
                "I'm unsure about how to apply for scholarships or financial aid. Can you provide guidance?",
                "What's the proper way to submit my application for scholarships or financial assistance?",
                "What's the process like for applying for scholarships or financial aid?",
                "How can I formally apply for scholarships or financial support?",
                "I'd appreciate guidance on applying for scholarships or financial aid.",
                "Can you explain the application process for scholarships or financial assistance?",
                "What's the procedure for putting in an application for scholarships or financial support?",
                "I need to understand how to go about applying for scholarships or financial aid. Can you assist?"
            ],
            "responses": [
                "The scholarship available in the college is from NSP that is provided every academic year to the students. Scholarship will be awarded to the students who have secured more than 50% marks in the previous final examination and annual income of their parents/guardian from all sources does not exceed Rs. 2.00 lakh per annum."
            ]
        },
        {
            "tag": "commite_clg",
            "patterns": [
                "Can you provide information about the different committees that exist within the college?",
                "What are the committees present in the college?",
                "Tell me about the various committees in the college.",
                "Could you list the committees within the college?",
                "I'm curious about the college's committees. Can you give me details?",
                "Are there any committees in the college? Tell me more.",
                "What kinds of committees operate within the college?",
                "Give me an overview of the college committees.",
                "I'd like to know about the committees established in the college.",
                "Please share details about the college's committee structure.",
                "Are there any specific committees in the college?",
                "Inform me about the committees that are part of the college.",
                "Tell me about any committees that exist in the college.",
                "Can you provide a list of committees in the college?",
                "I want to know more about the committees within the college.",
                "What committees are responsible for various activities in the college?",
                "Share information about the committees I can find in the college.",
                "Could you explain the roles of different committees in the college?",
                "What roles do committees play within the college environment?",
                "I'm interested in the roles and responsibilities of college committees.",
                "How do the committees in the college contribute to campus life?",
                "What is the significance of various committees in the college?",
                "I'd like to learn about the purpose of committees within the college.",
                "Tell me about the significance of committees within the college setup.",
                "Do committees have specific functions within the college?",
                "Explain the functions of different committees present in the college.",
                "How do committees enhance the college experience for students?",
                "Can you detail the responsibilities of committees within the college?",
                "I'm curious about how committees impact the college community.",
                "What kind of committees should students expect to find in the college?",
                "Give me insights into how committees contribute to the college's functioning."
            ],
            "responses": "The college has several committees including the Anti Ragging Committee and Anti Ragging Squad, Grievance Redressal Committee, Online Grievance Redressal Mechanism, Internal Complaint Committee, and SC/ ST Committee."
        },
        {
            "tag": "clg_onl",
            "patterns": [
                "How can I access the college's online learning resources and platforms?",
                "What is the procedure for accessing online learning resources at the college?",
                "Can you guide me on how to get to the college's online learning platforms?",
                "I want to know how I can log in to the college's online learning resources.",
                "Where can I find the college's online learning materials?",
                "What steps should I take to access online learning content at the college?",
                "Are there any guidelines on how to access the college's online learning resources?",
                "Please explain how I can access the college's online learning platforms.",
                "How do I get started with the college's online learning resources?",
                "Could you provide information on how I can access the college's online education tools?",
                "Tell me more about the online learning resources available at the college.",
                "What are the ways to reach the college's online learning platforms?",
                "I'm interested in knowing how to access the college's online education materials.",
                "Can you elaborate on the process of accessing online learning resources at the college?",
                "How can I log in to the college's online learning platforms?",
                "What are the available methods for me to access online learning materials from the college?",
                "Please guide me on the steps to access online learning resources at the college.",
                "I'd like to learn about the platforms through which I can access the college's online education content.",
                "What are the options for students to access the college's online learning resources?",
                "Could you share details about the online learning resources provided by the college?",
                "Where should I go to find the college's online learning resources?",
                "I need information on how to connect to the college's online learning platforms.",
                "What's the recommended way for students to access the college's online learning content?",
                "Tell me about the login process for the college's online learning platforms.",
                "How do I navigate to the online learning resources and platforms at the college?",
                "Are there any specific instructions for accessing the college's online education materials?",
                "Can you walk me through the steps of accessing the college's online learning resources?",
                "Please provide details about accessing the college's online learning resources.",
                "What are the online platforms I should use to access the college's educational content?",
                "I'm unsure about how to access the college's online learning resources. Can you help?",
                "Where can I find the college's online learning platforms?"
            ],
            "responses": "You can access the college's online learning resources and platforms by logging in to Google Classroom's application. Students can also avail online learning resources via YouTube playlists of teachers."
        },
        {
            "tag": "dsw_join",
            "patterns": [
                "How can I join DSW of the college committee?",
                "What is the process to become a part of the Dean Student Welfare?",
                "Can you guide me on how to get involved in the DSW committee?",
                "I'm interested in joining the college's DSW. How do I proceed?",
                "Tell me more about becoming a member of the DSW committee.",
                "What are the steps for students to join the DSW committee?",
                "Could you provide information on how to become a member of DSW?",
                "How can I contribute to the DSW committee as a student?",
                "Please explain the procedure for students to join the DSW.",
                "What's the way to get associated with the Dean Student Welfare?",
                "I'd like to know how to join the DSW committee. Can you help?",
                "What is the process for students to get involved with DSW?",
                "Tell me about the requirements for joining the DSW of the college.",
                "How do I become a part of the DSW committee at the college?",
                "What are the steps I need to follow to join the DSW?",
                "Can you walk me through the process of becoming a DSW member?",
                "I want to know how to join the DSW committee. Any guidance?",
                "What are the eligibility criteria for joining the Dean Student Welfare?",
                "Could you provide details on how I can join the DSW committee?",
                "How do I express my interest in becoming a member of DSW?",
                "Tell me about the application process for joining the DSW committee.",
                "What's the procedure to become an active member of DSW?",
                "I'm curious about joining the DSW committee. What's the process?",
                "How can I apply to be a part of the DSW of the college?",
                "Please guide me on the steps to join the DSW committee.",
                "What roles can students play after joining the DSW committee?",
                "Are there any specific qualifications needed to join the DSW?",
                "Tell me about the responsibilities of students in the DSW committee.",
                "What is expected from students who join the DSW?",
                "How do I become a recognized member of the DSW?",
                "I need information on how to get involved with the Dean Student Welfare."
            ],
            "responses": [
                "For joining the Dean Student Welfare, students first need to report to their respective departmental HODs. Then these students would be able to work in DSW on a trial basis. Based on the student's interest, presence, and capabilities, they will be given a role as a member, as decided by the DSW."
            ]
        },
        {
            "tag": "campus_schd",
            "patterns": [
                "How can I schedule a campus tour or attend an open house event?",
                "What's the process to book a campus tour or participate in an open house event?",
                "Can you guide me on how to arrange a visit to the campus or an open house event?",
                "I'm interested in touring the campus. How do I go about it?",
                "Tell me more about scheduling a campus tour or joining an open house event.",
                "What are the steps for students to schedule a campus tour or attend an open house?",
                "Could you provide information on how I can participate in a campus tour or open house?",
                "How can I attend a campus tour or open house event?",
                "Please explain the procedure for students to schedule a campus tour or attend an open house.",
                "What's the way to get information about campus tours and open house events?",
                "I'd like to know how to sign up for a campus tour or an open house event. Can you help?",
                "What is the process for students to arrange a visit to the campus or attend an open house?",
                "Tell me about the requirements for scheduling a campus tour or attending an open house event.",
                "How do I register for a campus tour or open house event?",
                "What are the steps I need to follow to attend a campus tour or open house?",
                "Can you walk me through the process of scheduling a campus tour or joining an open house event?",
                "I want to know how to participate in a campus tour or an open house event. Any guidance?",
                "What are the dates available for campus tours and open house events?",
                "Could you provide details on how I can join a campus tour or open house event?",
                "How do I express my interest in attending a campus tour or open house?",
                "Tell me about the registration process for campus tours and open house events.",
                "What's the procedure to participate in a campus tour or open house event?",
                "I'm curious about participating in a campus tour or open house event. What's the process?",
                "How can I sign up to attend a campus tour or open house event?",
                "Please guide me on the steps to register for a campus tour or open house event.",
                "What can students expect from campus tours and open house events?",
                "Are there any specific qualifications needed to attend campus tours or open house events?",
                "Tell me about the agenda and activities for campus tours and open house events.",
                "What is expected from students who attend campus tours or open house events?",
                "How do I get more information about upcoming campus tours and open house events?",
                "I need information on how to join a campus tour or attend an open house event."
            ],
            "responses": [
                "For scheduling a campus tour or attending an open house event, students need to approach the president of DSW, and then the president will assist the student for the same."
            ]
        },
        {
            "tag": "dsw_clubs",
            "patterns": [
                "What are the various clubs in DSW?",
                "Can you list the clubs that exist within DSW?",
                "Tell me about the clubs available under DSW.",
                "I'm interested in the clubs affiliated with DSW. What are they?",
                "Could you provide information about the clubs within DSW?",
                "Please list the different clubs that are part of DSW.",
                "What clubs can I find in the DSW setup?",
                "Give me details about the clubs operated by DSW.",
                "Are there any specific clubs under DSW? Tell me more.",
                "Tell me about the clubs associated with the Dean Student Welfare.",
                "I'd like to know about the various clubs in DSW. Can you help?",
                "What kinds of clubs are present within the DSW committee?",
                "Inform me about the different clubs that DSW manages.",
                "Tell me about any clubs that are part of DSW.",
                "Can you provide a list of clubs under the DSW committee?",
                "I want to know more about the clubs operated by DSW.",
                "What clubs are responsible for various activities in DSW?",
                "Share information about the clubs under DSW.",
                "Could you explain the roles of different clubs within DSW?",
                "What roles do clubs play within the DSW environment?",
                "I'm interested in the roles and activities of clubs in DSW.",
                "How do the clubs under DSW contribute to campus life?",
                "What is the significance of various clubs within DSW?",
                "I'd like to learn about the purpose of clubs under DSW.",
                "Tell me about the significance of clubs within the DSW setup.",
                "Do clubs have specific functions within DSW?",
                "Explain the functions of different clubs under DSW.",
                "How do clubs enhance the college experience for students?",
                "Can you detail the activities of clubs within DSW?",
                "I'm curious about how clubs impact the DSW community.",
                "What kind of clubs should students expect to find under DSW?"
            ],
            "responses": "The various clubs in DSW are: Discipline Club, Literature Club, Cultural Club, Food and Hospitality Club, Open Code Club, Transport Club, Technical Club, Arts and Crafts Club, Volunteer Club, Photography Club, and Sports Club."
        },
        {
            "tag": "time_table",
            "patterns": [
                "What are the class schedules at your college?",
                "Can you provide information about the college's class timings?",
                "Tell me about the daily schedule for classes at the college.",
                "How are classes scheduled at the college?",
                "Could you give me an overview of the class timings at the college?",
                "I'm interested in knowing the class schedules for the college. Can you share?",
                "Please provide details about the typical class timings at the college.",
                "What's the timetable like for classes at your college?",
                "I'd like to know the daily routine for classes at the college. Could you tell me?",
                "Can you explain the time slots for classes in your college?",
                "When are the classes usually held at your college?",
                "Tell me more about how classes are scheduled throughout the day at the college.",
                "What is the general pattern of classes in terms of timings?",
                "Could you walk me through the daily class schedule at the college?",
                "I want to understand the timing arrangement for classes at the college. Can you help?",
                "What's the standard timetable for classes at your college?",
                "Please describe the time slots for classes at the college.",
                "When does the first class usually start at the college?",
                "Tell me about the timings for the last class of the day at the college.",
                "What are the time intervals between consecutive classes at your college?",
                "I'm curious about the daily timetable for classes. Could you provide more information?",
                "How much time is allocated for each class at the college?",
                "Are there any specific break times between classes at the college?",
                "What is the duration of lunch breaks between classes at your college?",
                "Tell me about the arrangement of classes on weekdays and weekends.",
                "What are the timeframes for classes on weekdays and weekends?",
                "Can you explain the class schedules for both weekdays and weekends?",
                "I'd like to know the distribution of classes during the weekdays and weekends.",
                "How does the class schedule vary between weekdays and weekends?",
                "Tell me about the average length of a class at the college.",
                "Are there any variations in class timings for different departments or programs?"
            ],
            "responses": [
                "College classes are usually held on weekdays, Monday through Saturday, with Friday and Sunday being off. Classes are generally 50-60 minutes long. The first class of the day typically starts around 10:30 am, and the last class of the day typically ends around 3:00 or 3:30 pm. Moreover, the college schedules a one-hour lunch break in between classes to allow students time to eat and recharge before their next class. During this time, students can grab a bite to eat at the dining hall or nearby restaurants, relax, or catch up on any homework or studying."
            ]
        },
        {
            "tag": "class_size",
            "patterns": [
                "What is the average class size at your college?",
                "Can you provide information about the typical class size at the college?",
                "Tell me about the average number of students in a class at the college.",
                "How many students are usually in a class at your college?",
                "Could you share the average class size at the college?",
                "I'm interested in knowing the average number of students per class at your college.",
                "Please provide details about the class size at your college.",
                "What's the average size of classes at the college?",
                "I'd like to know the average number of students in a class. Can you tell me?",
                "Can you explain the usual number of students in a class at the college?",
                "What's the general class size at your college?",
                "Tell me more about the student count in an average class at your college.",
                "What is the typical class size in terms of student numbers?",
                "Could you provide insight into the average class size in your college?",
                "I want to understand the student-to-teacher ratio in a typical class. Can you help?",
                "What's the usual size of classes in terms of student enrollment?",
                "Please describe the average number of students per classroom at your college.",
                "How many students can I expect to find in a regular class at the college?",
                "Tell me about the average student count in a class at the college.",
                "What is the average enrollment in a typical classroom at your college?",
                "I'm curious about the average class size. Could you provide more information?",
                "How many students are accommodated in a typical class at your college?",
                "Are there any variations in class sizes across different departments or programs?",
                "Tell me about the number of students in classes for different subjects.",
                "What's the difference in class sizes between different courses at the college?",
                "Can you explain how class sizes vary based on the subject or level of study?",
                "I'd like to know if class sizes differ for various academic programs.",
                "Tell me about the class sizes for specialized courses at the college.",
                "What's the average student count for classes in different departments?",
                "Please provide information about the variation in class sizes for different subjects.",
                "How does the college manage class sizes for various academic levels?"
            ],
            "responses": [
                "The average class size at our college is typically between 35 to 45 students. This smaller class size allows for more individualized attention from professors and greater opportunities for hands-on learning experiences."
            ]
        },
        {
            "tag": "prsonal_info",
            "patterns": [
                "What's the process for updating personal information at college?",
                "Could you guide me on how to change my personal information at college?",
                "I need to update my personal details. How can I do that at college?",
                "Tell me the steps to modify my personal information in the college records.",
                "Can you provide information on updating personal details in college?",
                "How can I make changes to my personal information at college?",
                "What's the procedure to edit personal details in the college system?",
                "I want to update my personal information. What should I do at college?",
                "Where can I go to update my personal information at college?",
                "Is there a specific office or department I should visit to update my personal details?",
                "What documents are required to update personal information at college?",
                "Tell me about the documentation needed to change my personal details at college.",
                "Do I need to fill out a form to update my personal information at college?",
                "What's the timeline for updating personal information in the college system?",
                "Can I update my contact information online or do I need to visit the college in person?",
                "Is there an online portal to update personal details or should I go to the college office?",
                "Are there any restrictions on what personal information can be updated?",
                "Tell me about the information that can be modified in the college records.",
                "I need to correct some information in my records. How can I do that?",
                "What should I do if there's a mistake in my personal information at college?",
                "Can you explain the importance of keeping personal details up to date in college records?",
                "How often should I update my personal information at college?",
                "What's the protocol for updating personal details if I change my address?",
                "Is there a deadline for updating personal information for the upcoming semester?",
                "Tell me about any forms or applications required to update personal information.",
                "Can I update my emergency contact information at the college?",
                "What's the contact information for the registrar's office or student services?",
                "How do I get in touch with the relevant department for updating my personal information?",
                "Is there a specific time during which I can visit the office to update my personal details?",
                "Tell me more about the role of the registrar's office in updating personal information.",
                "I'm new to the college. How can I set up my personal information?"
            ],
            "responses": [
                "To update your personal information at college, you should contact the registrar's office or student services."
            ]
        },
        {
            "tag": "grade_check",
            "patterns": [
                "How can I view my grades?",
                "What's the process for checking my academic grades?",
                "Could you guide me on how to access my college grades?",
                "I'm interested in checking my grades. How do I do that?",
                "Tell me how to see my academic performance records.",
                "What steps do I need to follow to check my grades?",
                "Can you explain how I can review my academic progress?",
                "How do I access my grades for the current semester?",
                "Is there a way to check my marks for individual courses?",
                "What's the procedure for viewing my course grades?",
                "I need to check my academic performance. How can I proceed?",
                "Tell me more about how I can monitor my academic results.",
                "How can I find out about my scores in various subjects?",
                "What's the best way to keep track of my grades at college?",
                "I want to know how to check my performance in each course. Can you help?",
                "Can you explain how I can access my grade reports?",
                "Is there a specific platform or system for checking grades?",
                "What tools or resources are available for me to review my grades?",
                "Tell me about the options for checking my grades online.",
                "How do I get information about my exam results?",
                "I'm curious about the process for accessing my academic scores.",
                "What's the timeline for updating grades after exams?",
                "Can I check my grades on my mobile device?",
                "Tell me about any notifications for grade updates or changes.",
                "How often are grades updated in the student portal?",
                "Is there a tutorial on how to check my grades online?",
                "What if I have trouble accessing my grade information?",
                "Tell me about any additional resources for understanding my grades.",
                "How can I track my progress in different subjects?",
                "Are there any restrictions on when I can view my grades?",
                "Can you explain the significance of checking my grades regularly?"
            ],
            "responses": [
                "To check your grades at college, you can log in to your student portal and access your transcript."
            ]
        },
        {
            "tag": "ragging_policy",
            "patterns": [
                "Can you tell me about the college's stance on ragging?",
                "What does the college's anti-ragging policy involve?",
                "I'm curious about the college's policy regarding ragging. Could you provide details?",
                "Tell me more about the college's approach to preventing ragging.",
                "What measures has the college taken to combat ragging?",
                "Could you explain the rules and regulations against ragging at the college?",
                "I want to know about the guidelines for preventing ragging at the college.",
                "What disciplinary actions are taken against those involved in ragging?",
                "Is there a dedicated committee to address issues related to ragging?",
                "Can you provide information about the consequences of ragging as per the college policy?",
                "Tell me about the efforts made by the college to create an anti-ragging environment.",
                "How does the college create awareness about the harmful effects of ragging?",
                "What steps has the college taken to ensure a safe and welcoming atmosphere for students?",
                "Is there a helpline number or contact for reporting incidents related to ragging?",
                "I'd like to learn more about the implementation of anti-ragging measures at the college.",
                "Tell me about the role of the Anti Ragging Committee in maintaining discipline.",
                "Are there any awareness programs conducted for students about ragging?",
                "Can you explain the process of reporting incidents of ragging at the college?",
                "How are new students educated about the college's stand against ragging?",
                "Tell me about any recent initiatives taken by the college to prevent ragging.",
                "What are the legal implications of engaging in ragging as per college policy?",
                "Can you provide information about the initiatives taken to sensitize students about ragging?",
                "Tell me about the collaboration with local authorities to handle ragging cases.",
                "How does the college ensure a zero-tolerance policy towards ragging?",
                "What support is available for victims of ragging at the college?",
                "Tell me about the counseling services provided for students affected by ragging.",
                "Are there any penalties in place for those who violate the college's anti-ragging policy?",
                "Can you explain the role of the Anti Ragging Squad in maintaining campus safety?",
                "Tell me about the proactive measures taken by the college to prevent ragging incidents.",
                "What is the student community's role in upholding the college's anti-ragging policy?",
                "Can you provide information about the workshops conducted to address ragging awareness?"
            ],
            "responses": [
                "The policy of the college on ragging is that it is an illegal activity and is completely prohibited. The college has implemented an Anti Ragging Committee and Anti Ragging Squad to investigate and prevent ragging."
            ]
        },
        {
            "tag": "career_cncl",
            "patterns": [
                "Tell me about the career counseling services for job placements at the college.",
                "How does the college assist students with job placements through career counseling?",
                "Can you provide information about the career guidance services for students?",
                "What support does the college offer for students seeking job placements?",
                "Is there a dedicated career counseling program to help students with their careers?",
                "I'm interested in career counseling for job placements. Can you tell me more?",
                "How can I access the career counseling services provided by the college?",
                "Tell me about the available resources for career counseling at the college.",
                "What role does the career counseling service play in students' job placements?",
                "Can you explain the benefits of attending career counseling sessions for job placements?",
                "Tell me about the workshops or seminars related to career counseling for job placements.",
                "How can career counseling contribute to enhancing students' employability?",
                "Is there a specific department or office that handles career counseling for job placements?",
                "Tell me about the experts or professionals who conduct career counseling sessions.",
                "What's the process for students to seek advice through career counseling for job placements?",
                "Can you provide information about the success rate of students who utilize career counseling?",
                "Tell me more about the strategies used in career counseling to help with job placements.",
                "How can students make the most of the career counseling services for job placements?",
                "Is there a cost associated with accessing career counseling services for job placements?",
                "Tell me about the range of industries covered in the career counseling services.",
                "What kind of personalized guidance can students expect from career counseling?",
                "Tell me about any partnerships or connections the college has for job placement support.",
                "How does career counseling align with students' long-term career goals?",
                "Tell me about the resources available for resume building and interview preparation.",
                "What's the process for scheduling a career counseling session for job placements?",
                "How does career counseling adapt to the changing job market and industries?",
                "Tell me about alumni success stories facilitated by career counseling at the college.",
                "Can you provide examples of specific skills or knowledge gained through career counseling?",
                "How do career counseling services address students' individual strengths and weaknesses?",
                "Tell me about the role of mock interviews in career counseling for job placements."
            ],
            "responses": [
                "Yes, our college offers various forms of career counseling services to help students with job placements. There are both online and offline sessions held by renowned career advisors. Students can access these services and benefit from utilizing them to enhance their post-college career prospects."
            ]
        },
        {
            "tag": "picnic",
            "patterns": [
                "Are there any picnics or outings planned by the college?",
                "Tell me about college-organized picnics and outings.",
                "Do you arrange any recreational trips for students?",
                "I'm curious if the college plans any picnics or outdoor activities.",
                "Can you provide information about college-sponsored outings?",
                "Are there any upcoming trips or picnics organized by the college?",
                "Tell me about leisure activities and outdoor events at the college.",
                "Do you have any events where students can unwind and enjoy?",
                "What kind of recreational events does the college organize?",
                "Is there a chance for students to go on college-sponsored trips?",
                "I'd like to know if the college arranges picnics for students.",
                "Can you give me details about outdoor events hosted by the college?",
                "Tell me more about the college's approach to student leisure and fun activities.",
                "Are there any plans for students to engage in outdoor activities?",
                "Do you organize any outings that help students relax and connect?",
                "Could you provide information on college-organized picnic destinations?",
                "Tell me about the opportunities for students to go on college trips.",
                "What types of outdoor events are typically offered by the college?",
                "Are there any upcoming outings that students should know about?",
                "Tell me about recreational activities organized by the college.",
                "Do you have any updates on the next college picnic?",
                "What can students expect from the college's outdoor activity plans?",
                "Are there any guidelines or rules for students during college picnics?",
                "Tell me about the frequency of college-sponsored outings.",
                "Do you organize trips to nearby tourist attractions?",
                "How can students find out about upcoming college outings?",
                "Tell me about the role of student feedback in planning college picnics.",
                "Are there any charges or fees associated with participating in college outings?",
                "Do you arrange group activities for students to enjoy together?",
                "Tell me about the benefits of participating in college-organized picnics.",
                "What's the process for signing up for college picnics?"
            ],
            "responses": [
                "Certainly! Youre in luck  our college does indeed arrange exciting picnics and outings for students. These events are designed to provide you with a refreshing break from academics and a chance to bond with your peers. Stay tuned for updates on upcoming picnics via our official communication channels."
            ]
        },
        {
            "tag": "adv_trp",
            "patterns": [
                "Tell me about any outdoor adventure trips organized by the college?",
                "Can you provide information about recent college-organized adventure trips?",
                "Do you offer any exciting outdoor adventure opportunities for students?",
                "What kind of outdoor adventure trips are available for college students?",
                "I'm interested in joining college-sponsored outdoor adventure activities. Could you tell me more?",
                "Are there any thrilling outdoor excursions students can participate in?",
                "Could you give me details about recent adventure trips organized by the college?",
                "Tell me about the outdoor adventure options provided by the college.",
                "Are there any opportunities for students to experience outdoor adventures through the college?",
                "I'd like to know if the college arranges any outdoor adventure experiences.",
                "Can you share information about college-sponsored adventure trips?",
                "Tell me more about the outdoor adventure programs offered by the college.",
                "What destinations have college students explored during outdoor adventure trips?",
                "Do you organize outdoor trips that focus on team-building and skills development?",
                "Could you provide details about the locations visited during recent outdoor adventure trips?",
                "Tell me about any upcoming outdoor adventure trips students can participate in.",
                "Are there any guidelines or requirements for participating in outdoor adventure trips?",
                "What's the process for registering for college-organized outdoor adventure activities?",
                "I'm curious about the outdoor adventure opportunities available to students. Can you elaborate?",
                "Tell me about the benefits of participating in college-sponsored outdoor adventure trips.",
                "Do you offer outdoor adventure trips during specific times of the year?",
                "Could you provide examples of activities students engage in during outdoor adventure trips?",
                "Tell me about the safety measures taken during college-organized outdoor adventure trips.",
                "Are there any fees or costs associated with joining outdoor adventure trips?",
                "What's the role of experienced guides in college-organized outdoor adventure trips?",
                "Can you explain how outdoor adventure trips contribute to students' personal growth?",
                "Tell me about the importance of outdoor experiences in college education.",
                "What's the feedback from students who have participated in outdoor adventure trips?",
                "Do you plan outdoor trips that cater to different skill levels and interests?",
                "Tell me about the opportunities for students to build friendships during outdoor adventure trips.",
                "How can students stay informed about upcoming outdoor adventure trips?"
            ],
            "responses": [
                "Certainly! Our college offers a range of thrilling outdoor adventure trips for students to enjoy. Recent trips have included Ladakh, Pahalgam, Kokernag, Verinag, and many more. These trips not only provide you with an adrenaline rush but also help you connect with nature and build lasting friendships with fellow adventurers. Keep an eye on our announcements for upcoming outdoor adventure opportunities!"
            ]
        },
        {
            "tag": "alumi_mem",
            "patterns": [
                "Can you provide information about the members of the alumni association?",
                "Tell me about the individuals in the alumni association.",
                "Who are the members of the college's alumni association?",
                "I'm curious about the alumni association's member roster. Can you share details?",
                "Could you give me a list of alumni association members?",
                "What individuals make up the college's alumni association?",
                "Tell me more about the people who are part of the alumni association.",
                "Do you have information about the alumni association's member profiles?",
                "Who are the notable members of the college's alumni association?",
                "I'd like to know about the alumni association's member community. Can you provide details?",
                "Could you provide the names of alumni association members?",
                "Tell me about the graduates who are part of the alumni association.",
                "What's the composition of the college's alumni association?",
                "Do you have a list of alumni association members available?",
                "Tell me about the individuals who have joined the alumni association.",
                "Can you share details about the members in the alumni association?",
                "Who are the current members of the college's alumni association?",
                "I'm interested in knowing about the people associated with the alumni association.",
                "Could you provide a list of alumni association members' names?",
                "Tell me more about the individuals who are part of the alumni association.",
                "What's the background of the college's alumni association members?",
                "Do you have a roster of alumni association members?",
                "Tell me about the alumni association members' roles and achievements.",
                "Can you provide information about the alumni association's member community?",
                "Who are the alumni association leaders and contributors?",
                "I'd like to learn about the people who make up the alumni association. Can you help?",
                "Tell me about the profiles and accomplishments of the alumni association members.",
                "What roles do the alumni association members play in college activities?",
                "Could you provide a summary of notable alumni association members?",
                "Tell me about the alumni association's contribution to the college community."
            ],
            "responses": [
                "Certainly! Our alumni association is a vibrant community comprising graduates from various years and fields. The members of the alumni association are as follows:\nProf. (Dr.) Nazir Ahmad Shah (President)\nDr. Sajad Hussain Din (Vice President)\nEr. Manzoor Ahmad Mir (General Secretary)\nEr. Mohmad Nayeem (Joint Secretary)\nEr. Ishtiyaq Shafi Rafiqi (Joint Secretary)\nEr. Shabina Masoodi (Treasurer)\nEr. Majid Derwesh (Technical Support Officer)"
            ]
        },
        {
            "tag": "branch_swtch",
            "patterns": [
                "What is the process for switching to a different engineering branch?",
                "How can I change my engineering branch?",
                "Can you guide me through the process of switching engineering branches?",
                "What steps are involved in changing my engineering stream?",
                "I'm interested in changing my engineering branch. What's the procedure?",
                "Can you provide information about branch change in engineering?",
                "Tell me about the process of transferring to a different engineering branch.",
                "Is it possible to switch to another engineering branch? How?",
                "I want to know how to change my engineering specialization. Can you help?",
                "What do I need to do to change my current engineering branch?",
                "Tell me about the steps to transfer to a different engineering discipline.",
                "Is there a way to switch my engineering stream within the college?",
                "How do I apply for a change in my engineering branch?",
                "Tell me about the criteria and process for changing engineering branches.",
                "Can you explain the rules and regulations for switching engineering disciplines?",
                "How can I request a change in my engineering major?",
                "Tell me about the formal procedure to switch my engineering specialization.",
                "What's the protocol for changing my engineering field of study?",
                "Can you guide me on how to change my engineering branch?",
                "Tell me about the formalities of switching to a different engineering stream.",
                "What are the steps for transferring to another engineering branch?",
                "Is it possible to change engineering branches within the college?",
                "Tell me about the eligibility criteria for changing my engineering discipline.",
                "Can I get more details about changing my engineering major?",
                "What's the process for requesting a shift to another engineering branch?",
                "Tell me about the procedure to switch from one engineering branch to another.",
                "Is there a timeline or specific period to apply for a branch change in engineering?",
                "How do I initiate the process of changing my engineering specialization?",
                "Tell me about the prerequisites for applying for a change in engineering branches.",
                "Can you explain how the college handles requests for changing engineering branches?"
            ],
            "responses": [
                "Changing your engineering branch is possible, but its subject to certain guidelines and availability. To initiate the process, you generally need to follow these steps:\n\n1. Check if there are any specific eligibility criteria for branch change.\n2. Review the availability of seats in the desired branch.\n3. Fill out the official branch change application form during the designated period.\n4. Your application will be evaluated based on factors like your academic performance and the availability of seats.\n5. If your application is accepted, youll be notified about the branch change.\n\nPlease note that branch change might not always be guaranteed due to seat limitations and academic requirements. I recommend reaching out to the colleges academic advising office or the registrars office for specific information tailored to your situation."
            ]
        } 
    ]
}